src/InformationRegisters/Замены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Замены</Name>
			<Comment>Замены</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Comment>Группа замены</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество замены</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗамены</Name>
					<Comment>Дата замены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Comment>Дата обновления</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание замены</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Артикул номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АртикулЗамены</Name>
					<Comment>Артикул номенклатуры замены</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Comment>Производитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Замены/Forms/ЗаменыНоменклатуры/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль формы ДополнительныеРеквизитыНоменклатуры:
// Служит для заполнения дополнительных параметров номенклатуры
// в разрезе подразделений компании.
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("Номенклатура") Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Номенклатура = Параметры.Номенклатура;
	ЗаполнитьРеквизитыНоменклатуры();
	ЗагрузитьЗамены();
	
	ПравоДоступаИзменение = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.Замены);
	Элементы.ДобавитьЗамену.Видимость = ПравоДоступаИзменение;
	Элементы.УдалитьЗамену.Видимость  = ПравоДоступаИзменение;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеДиалогомНаКлиенте(Элементы.ГруппаЗаменыЗаменители.ТекущаяСтраница.Имя);
	
КонецПроцедуры // ПриОткрытии()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаЗаменыЗаменителиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УправлениеДиалогомНаКлиенте(ТекущаяСтраница.Имя);
	
КонецПроцедуры //ГруппаЗаменыЗаменителиПриСменеСтраницы()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьЗамену(Команда)
	
	// Сформируем параметры
	ПараметрыФормы = Новый Структура;
	Если Элементы.ГруппаЗаменыЗаменители.ТекущаяСтраница.Имя = "СтраницаЗаменители" Тогда
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Артикул", Артикул));
	Иначе
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("АртикулЗамены", Артикул));
	КонецЕсли;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаДобавленияЗаменыНоменклатуры",
		ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.Замены.ФормаЗаписи",
		ПараметрыФормы,
		ЭтотОбъект,
		,,,
		ОбработчикОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ДобавитьЗамену()

&НаСервереБезКонтекста
Процедура УдалитьЗаменуНаСервере(Параметры)
	
	Если Параметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи               = РегистрыСведений.Замены.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Артикул       = Параметры.Артикул;
	МенеджерЗаписи.АртикулЗамены = Параметры.АртикулЗамены;
	МенеджерЗаписи.Производитель = Параметры.Производитель;
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры // УдалитьЗаменуНаСервере()

&НаКлиенте
Процедура УдалитьЗамену(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	
	Если Элементы.ГруппаЗаменыЗаменители.ТекущаяСтраница.Имя = "СтраницаЗаменители" Тогда
		
		Данные = Элементы.ТаблицаЗаменНовые.ТекущиеДанные;
		Если Данные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ДополнительныеПараметры.Вставить("Артикул",       Артикул);
		ДополнительныеПараметры.Вставить("АртикулЗамены", Данные.Артикул);
		ДополнительныеПараметры.Вставить("Производитель", Данные.Производитель);
		
	Иначе
		
		Данные = Элементы.ТаблицаЗаменСтарые.ТекущиеДанные;
		Если Данные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ДополнительныеПараметры.Вставить("Артикул",       Данные.Артикул);
		ДополнительныеПараметры.Вставить("АртикулЗамены", Артикул);
		ДополнительныеПараметры.Вставить("Производитель", Данные.Производитель);
		
	КонецЕсли;
	
	УдалитьЗаменуНаСервере(ДополнительныеПараметры);
	
	ЗагрузитьЗамены();
	
	УправлениеДиалогомНаКлиенте(Элементы.ГруппаЗаменыЗаменители.ТекущаяСтраница.Имя);
	
КонецПроцедуры // УдалитьЗамену()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьЗамены()
	
	ЗаменыСтарые.Очистить();
	ЗаменыНовые.Очистить();
	
	ТаблицаЗамен = Справочники.Номенклатура.ПолучитьТаблицуЗамен(Номенклатура, Артикул, Производитель);
	ЗаменыСтарые.Загрузить(Справочники.Номенклатура.ПолучитьЗаменыНоменклатуры(Ложь, ТаблицаЗамен));
	ЗаменыНовые.Загрузить(Справочники.Номенклатура.ПолучитьЗаменыНоменклатуры(Истина, ТаблицаЗамен));
	
	// Заполним номера строк в ТЧ
	НомерСтроки = 1;
	Для Каждого ТекущаяСтрока Из ЗаменыСтарые Цикл
		ТекущаяСтрока.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	НомерСтроки = 1;
	Для Каждого ТекущаяСтрока Из ЗаменыНовые Цикл
		ТекущаяСтрока.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьЗамены()

&НаСервере
Процедура ЗаполнитьРеквизитыНоменклатуры()
	
	РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "Артикул,Производитель");
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыНоменклатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаДобавленияЗаменыНоменклатуры(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	ЗагрузитьЗамены();
	УправлениеДиалогомНаКлиенте(Элементы.ГруппаЗаменыЗаменители.ТекущаяСтраница.Имя);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаДобавленияЗаменыНоменклатуры()

&НаКлиенте
Процедура УправлениеДиалогомНаКлиенте(ТекущаяСтраница)
	
	Если ТекущаяСтраница = "СтраницаЗаменители" Тогда
		Элементы.УдалитьЗамену.Доступность = (ЗаменыНовые.Количество()>0);
	Иначе
		Элементы.УдалитьЗамену.Доступность = (ЗаменыСтарые.Количество()>0);
	КонецЕсли;
	
КонецПроцедуры // УправлениеДиалогомНаКлиенте()

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Цвет текста
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаЗаменСтарые");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗаменыСтарые.Количество");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(0,128,0));
	
	// Цвет текста
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаЗаменНовые");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗаменыНовые.Количество");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(0,128,0));
	
	// Цвет текста
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаЗаменСтарые");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗаменыСтарые.Номенклатура");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(127,127,127));
	// Цвет текста
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаЗаменНовые");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗаменыНовые.Номенклатура");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(127,127,127));
	
КонецПроцедуры

#КонецОбласти
